<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data shape="1,3,640,640" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="images">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="/model.18/Constant_13_output_0" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2, 8400" offset="0" size="67200" />
			<output>
				<port id="0" precision="FP32" names="/model.18/Constant_13_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>8400</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="onnx::Conv_401" type="Const" version="opset1">
			<data element_type="f32" shape="8, 3, 3, 3" offset="67200" size="864" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_401">
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/model.0/conv/conv.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Reshape_138" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="68064" size="32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/model.0/conv/conv.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/conv/conv.0/Conv_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/model.0/conv/conv.2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/conv/conv.2/Relu_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="model.1.blocks.0.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 8, 3, 3" offset="68096" size="4608" />
			<output>
				<port id="0" precision="FP32" names="model.1.blocks.0.rbr_reparam.weight">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/model.1/blocks/blocks.0/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Reshape_152" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="72704" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/model.1/blocks/blocks.0/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.1/blocks/blocks.0/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/model.1/blocks/blocks.0/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.1/blocks/blocks.0/act/Relu_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="model.2.blocks.0.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="24, 16, 3, 3" offset="72768" size="13824" />
			<output>
				<port id="0" precision="FP32" names="model.2.blocks.0.rbr_reparam.weight">
					<dim>24</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/model.2/blocks/blocks.0/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_166" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="86592" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/model.2/blocks/blocks.0/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.2/blocks/blocks.0/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/model.2/blocks/blocks.0/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.2/blocks/blocks.0/act/Relu_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="model.3.blocks.0.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="48, 24, 3, 3" offset="86688" size="41472" />
			<output>
				<port id="0" precision="FP32" names="model.3.blocks.0.rbr_reparam.weight">
					<dim>48</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/model.3/blocks/blocks.0/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Reshape_180" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="128160" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/model.3/blocks/blocks.0/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.3/blocks/blocks.0/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/model.3/blocks/blocks.0/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.3/blocks/blocks.0/act/Relu_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="model.3.blocks.1.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="48, 48, 3, 3" offset="128352" size="82944" />
			<output>
				<port id="0" precision="FP32" names="model.3.blocks.1.rbr_reparam.weight">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/model.3/blocks/blocks.1/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_194" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="211296" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/model.3/blocks/blocks.1/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.3/blocks/blocks.1/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/model.3/blocks/blocks.1/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.3/blocks/blocks.1/act/Relu_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="model.4.blocks.0.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="96, 48, 3, 3" offset="211488" size="165888" />
			<output>
				<port id="0" precision="FP32" names="model.4.blocks.0.rbr_reparam.weight">
					<dim>96</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/model.4/blocks/blocks.0/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_208" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="377376" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/model.4/blocks/blocks.0/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.4/blocks/blocks.0/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/model.4/blocks/blocks.0/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.4/blocks/blocks.0/act/Relu_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="model.5.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="48, 96, 1, 1" offset="377760" size="18432" />
			<output>
				<port id="0" precision="FP32" names="model.5.cv1.conv.weight">
					<dim>48</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/model.5/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_222" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="396192" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/model.5/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.5/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/model.5/cv1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.5/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/model.5/m/MaxPool" type="MaxPool" version="opset8">
			<data strides="1, 1" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" kernel="5, 5" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.5/m/MaxPool_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/model.5/m_1/MaxPool" type="MaxPool" version="opset8">
			<data strides="1, 1" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" kernel="5, 5" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.5/m_1/MaxPool_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/model.5/m_2/MaxPool" type="MaxPool" version="opset8">
			<data strides="1, 1" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" kernel="5, 5" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.5/m_2/MaxPool_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/model.5/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="/model.5/Concat_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="model.5.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="96, 192, 1, 1" offset="396384" size="73728" />
			<output>
				<port id="0" precision="FP32" names="model.5.cv2.conv.weight">
					<dim>96</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/model.5/cv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Reshape_241" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="470112" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/model.5/cv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.5/cv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/model.5/cv2/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.5/cv2/act/Mul_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/model.6/Constant_output_0" type="Const" version="opset1">
			<data element_type="f32" shape="4" offset="470496" size="16" />
			<output>
				<port id="0" precision="FP32" names="/model.6/Constant_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/model.6/Resize" type="Interpolate" version="opset11">
			<data mode="nearest" shape_calculation_mode="scales" coordinate_transformation_mode="asymmetric" nearest_mode="floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.6/Resize_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/model.7/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.7/Concat_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="model.8.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="48, 144, 1, 1" offset="470512" size="27648" />
			<output>
				<port id="0" precision="FP32" names="model.8.cv1.conv.weight">
					<dim>48</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/model.8/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Reshape_258" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="498160" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/model.8/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.8/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/model.8/cv1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.8/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_262" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="498352" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="55" name="Constant_263" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="498360" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/model.8/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model.8/Split_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="4" precision="FP32" names="/model.8/Split_output_1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="model.8.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 3, 3" offset="498376" size="20736" />
			<output>
				<port id="0" precision="FP32" names="model.8.m.0.cv1.conv.weight">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/model.8/m.0/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Reshape_276" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="519112" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/model.8/m.0/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.8/m.0/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/model.8/m.0/cv1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.8/m.0/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="model.8.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 3, 3" offset="519208" size="20736" />
			<output>
				<port id="0" precision="FP32" names="model.8.m.0.cv2.conv.weight">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/model.8/m.0/cv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Reshape_291" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="539944" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/model.8/m.0/cv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.8/m.0/cv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/model.8/m.0/cv2/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.8/m.0/cv2/act/Mul_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/model.8/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model.8/Concat_output_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="model.8.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="48, 72, 1, 1" offset="540040" size="13824" />
			<output>
				<port id="0" precision="FP32" names="model.8.cv2.conv.weight">
					<dim>48</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/model.8/cv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Reshape_307" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="553864" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/model.8/cv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.8/cv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/model.8/cv2/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.8/cv2/act/Mul_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/model.9/Resize" type="Interpolate" version="opset11">
			<data mode="nearest" shape_calculation_mode="scales" coordinate_transformation_mode="asymmetric" nearest_mode="floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.9/Resize_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/model.10/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.10/Concat_output_0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="model.11.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="24, 72, 1, 1" offset="554056" size="6912" />
			<output>
				<port id="0" precision="FP32" names="model.11.cv1.conv.weight">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/model.11/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Reshape_324" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="560968" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/model.11/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.11/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/model.11/cv1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.11/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_328" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="498352" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="81" name="Constant_329" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="561064" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/model.11/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model.11/Split_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="4" precision="FP32" names="/model.11/Split_output_1">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="model.11.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="12, 12, 3, 3" offset="561080" size="5184" />
			<output>
				<port id="0" precision="FP32" names="model.11.m.0.cv1.conv.weight">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/model.11/m.0/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Reshape_342" type="Const" version="opset1">
			<data element_type="f32" shape="1, 12, 1, 1" offset="566264" size="48" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/model.11/m.0/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.11/m.0/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/model.11/m.0/cv1/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.11/m.0/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="model.11.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="12, 12, 3, 3" offset="566312" size="5184" />
			<output>
				<port id="0" precision="FP32" names="model.11.m.0.cv2.conv.weight">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/model.11/m.0/cv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>12</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Reshape_357" type="Const" version="opset1">
			<data element_type="f32" shape="1, 12, 1, 1" offset="571496" size="48" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/model.11/m.0/cv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.11/m.0/cv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/model.11/m.0/cv2/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.11/m.0/cv2/act/Mul_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/model.11/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model.11/Concat_output_0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="model.11.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="24, 36, 1, 1" offset="571544" size="3456" />
			<output>
				<port id="0" precision="FP32" names="model.11.cv2.conv.weight">
					<dim>24</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/model.11/cv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>36</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>36</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Reshape_373" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="575000" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/model.11/cv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.11/cv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/model.11/cv2/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.11/cv2/act/Mul_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="model.18.cv2.0.0.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 24, 3, 3" offset="575096" size="55296" />
			<output>
				<port id="0" precision="FP32" names="model.18.cv2.0.0.conv.weight">
					<dim>64</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/model.18/cv2.0/cv2.0.0/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Reshape_414" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="630392" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/model.18/cv2.0/cv2.0.0/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.18/cv2.0/cv2.0.0/conv/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/model.18/cv2.0/cv2.0.0/act/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.18/cv2.0/cv2.0.0/act/Mul_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="model.18.cv2.0.1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="630648" size="147456" />
			<output>
				<port id="0" precision="FP32" names="model.18.cv2.0.1.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/model.18/cv2.0/cv2.0.1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
